# Taps
tap "xcodesorg/made"
tap "withgraphite/tap"

# Formulae
brew "cjson"
brew "cmake"
brew "defaultbrowser"
brew "ffmpeg"
brew "fizz"
brew "gettext"
brew "gh"
brew "withgraphite/tap/graphite"
brew "jq"
brew "mysql-client@8.0"
brew "npm"
brew "openssl@3"
brew "python@3.12"
brew "python@3.13"
brew "ruby-install"
brew "scrcpy"
brew "sqlite"
brew "tmux"
brew "uv"
brew "watchman"
brew "xcodes"
brew "yarn"

# Casks
cask "google-chrome"
cask "cursor"
cask "slack"
cask "gcloud-cli"
cask "ghostty"
cask "tuple"
cask "spotify"
cask "logitune"
